<?php
//include('connect.php');
// $db->exec('create table if not exists train( id int(5) not null auto_increment primary key,
   // start_time varchar(50),finsh_time varchar(50),time varchar(50),  
   // from_site varchar(50),to_site varchar(50),speed varchar(50),
   // classk varchar(50),number int(5));');  
   // 9 attribute
  // $db->exec("insert into train values 
  // ('', '12:19 ص', '22:15 م', '10:14', 'اسيوط', 'القاهرة', '100كم/الساعة ', 'مكيف', '5'),
  // ('', '02:11 م', '23:15 م', '10:14', 'اسيوط', 'اسوان', '70 كم/الساعة ', 'نوم', '2'),
  // ('', '12:19 8', '22:15 م', '10:14', 'اسيوط', 'القاهرة', '100كم/الساعة ', 'مكيف', '5'),
  // ('', '12:19 2', '22:15 م', '10:14', 'اسيوط', 'القاهرة', '100كم/الساعة ', 'مكيف', '5'),
  // ('', '12:19 10', '22:15 م', '10:14', 'اسيوط', 'القاهرة', '100كم/الساعة ', 'مكيف', '5'),
  // ('', '12:19 4', '22:15 م', '10:14', 'اسيوط', 'القاهرة', '100كم/الساعة ', 'مكيف', '5'),
  // ('', '12:19 ص', '22:15 م', '10:14', 'اسيوط', 'القاهرة', '100كم/الساعة ', 'مكيف', '5'),
  // ('', '12:19 ص', '22:15 م', '10:14', 'اسيوط', 'القاهرة', '100كم/الساعة ', 'مكيف', '5'),
  // ('', '12:19 1', '22:15 م', '10:14', 'اسيوط', 'القاهرة', '100كم/الساعة ', 'مكيف', '5'),
  // ('', '12:19 2', '22:15 م', '10:14', 'اسيوط', 'القاهرة', '100كم/الساعة ', 'مكيف', '5'),
  // ('', '12:19 3', '22:15 م', '10:14', 'اسيوط', 'القاهرة', '100كم/الساعة ', 'مكيف', '5'),
  // ('', '12:19 4', '22:15 م', '10:14', 'اسيوط', 'القاهرة', '100كم/الساعة ', 'مكيف', '5')
  // ");


?>